{
  "navbar": {
    "name": "אלאור איצקוביץ'",
    "home": "בית",
    "about": "עליי",
    "projects": "פרויקטים",
    "contact": "צור קשר",
    "dark_mode": "מצב כהה",
    "light_mode": "מצב בהיר"
  },
  "banner": {
    "name": "אלאור איצקוביץ'",
    "title": "מפתח פול-סטאק",
    "description": "בונה אפליקציות ווב חזקות עם React, Node.js, וכלי ענן מודרניים."
  },
  "footer": {
    "text": "אלאור איצקוביץ'. כל הזכויות שמורות."    
  },
  "about": {
    "title": "על עצמי",
    "cv": "קורות חיים",
    "introduction": {
      "title": "מבוא",
      "1": "שלום! שמי אלאור. מאז שאני זוכר את עצמי, תמיד הייתי מוקסם מבניית דברים ויצירתם עם מה שהיה לי ביד. הזמן והסקרנות הובילו אותי לחקור את עולם הטכנולוגיה והתכנות, שם יכולתי לאחד את החלומות, הרעיונות והתחומים שלי - ולעצב אותם למציאות.",
      "2": "אני מאוד נלהב מבניית אפליקציות מודרניות, סקלאביליות וידידותיות למשתמש, כמו גם מלמידה והתאמה לטכנולוגיות ומסגרות חדשות. אני תמיד רוצה ללמוד ולצמוח, ואני מאמין שהדרך הטובה ביותר לעשות זאת היא על ידי אתגר מתמיד של עצמנו.",
      "3": "כיום, אני בוגר טרי במדעי המחשב, חוקר את עולם פיתוח הפול-סטאק, לומד ומתנסה עם טכנולוגיות ומסגרות שונות - בעיקר React, Node.js ומיקרו-שירותים."
    },
    "skills": {
      "title": "מיומנויות",      
      "switchToFlat": "מעבר לתצוגה שטוחה",
      "switchToGrouped": "מעבר לתצוגה מקובצת"
    },
    "contributions": {
      "title": "תרומות",
      "1": "אני נהנה לבנות כלים שניתן לעשות בהם שימוש חוזר כדי לתמוך בפרויקטים שלי. דוגמה אחת היא {link:server-essentials}, חבילת npm שנכתבה ב-TypeScript עבור שרתי Node.js, הכוללת אוסף של כלי עזר שניתן לעשות בהם שימוש חוזר וזמינה לציבור."
    },
    "hobbies": {
      "title": "תחביבים ותחומי עניין",
      "1": "כשאני לא מקודד או לומד, אני משתדל להקדיש את זמני הפנוי לרשימה הארוכה של התחביבים והתחומים שמעניינים אותי. לדוגמה, אני מאוד אוהב לשלב את האהבה שלי לציור ולעיצוב גרפי עם הפרויקטים שלי.",
      "2": "אני גם נהנה לנסוע ולחקור מקומות חדשים, לצלם אדריכלות, טבע ונופים, כמו גם לבלות זמן עם המשפחה שלי."
    }
  },
  "skills": {
    "programmingLanguages": "שפות תכנות",
    "frontendDevelopment": "פיתוח צד לקוח",
    "backendDevelopment": "פיתוח צד שרת",
    "databaseManagement": "ניהול מסדי נתונים",
    "devopsCloud": "דבאופס וענן",
    "versionControl": "בקרת גרסאות",
    "testingAutomation": "בדיקות ואוטומציה",
    "languages": "שפות"
  }
}