{
  "navbar": {
    "name": "אלאור איצקוביץ'",
    "home": "בית",
    "about": "עליי",
    "projects": "פרויקטים",
    "contact": "צור קשר",
    "dark_mode": "מצב כהה",
    "light_mode": "מצב בהיר",
    "language": "שפה"
  },
  "banner": {
    "name": "אלאור איצקוביץ'",
    "title": "מפתח פול-סטאק",
    "description": "בונה אפליקציות ווב עם React, Node.js, וכלי ענן מודרניים."
  },
  "footer": {
    "text": "אלאור איצקוביץ'. כל הזכויות שמורות."
  },
  "techStack": {
    "title": "טכנולוגיות"
  },
  "github": {
    "overview": "סקירה כללית של גיטהאב",
    "loading": "טוען נתוני גיטהאב...",
    "profile": "פרופיל גיטהאב",
    "languages": "השפות הנפוצות ביותר",
    "repositories": "תיקיות",
    "stars": "כוכבים",
    "followers": "עוקבים",
    "following": "עוקב אחרי",
    "topRepositories": "התיקיות המובילות שלי"
  },
  "about": {
    "title": "על עצמי",
    "introduction": {
      "title": "מבוא",
      "1": "שלום! שמי אלאור. מאז שאני זוכר את עצמי, תמיד הייתי מוקסם מבניית דברים ויצירתם עם מה שהיה לי ביד. הזמן והסקרנות הובילו אותי לחקור את עולם הטכנולוגיה והתכנות, שם יכולתי לאחד את החלומות, הרעיונות והתחומים שלי - ולעצב אותם למציאות.",
      "2": "אני מאוד נלהב מבניית אפליקציות מודרניות, סקלאביליות וידידותיות למשתמש, כמו גם מלמידה והתאמה לטכנולוגיות ומסגרות חדשות. אני תמיד רוצה ללמוד ולצמוח, ואני מאמין שהדרך הטובה ביותר לעשות זאת היא על ידי אתגר מתמיד של עצמנו.",
      "3": "כיום, אני בוגר טרי במדעי המחשב, חוקר את עולם פיתוח הפול-סטאק, לומד ומתנסה עם טכנולוגיות ומסגרות שונות - בעיקר React, Node.js ומיקרו-שירותים."
    },
    "skills": {
      "title": "מיומנויות",
      "switchToFlat": "מעבר לתצוגה שטוחה",
      "switchToGrouped": "מעבר לתצוגה מקובצת"
    },
    "contributions": {
      "title": "תרומות",
      "1": "אני נהנה לבנות כלים שניתן לעשות בהם שימוש חוזר כדי לתמוך בפרויקטים שלי. דוגמה אחת היא {link:server-essentials}, חבילת npm שנכתבה ב-TypeScript עבור שרתי Node.js, הכוללת אוסף של כלי עזר שניתן לעשות בהם שימוש חוזר וזמינה לציבור."
    },
    "hobbies": {
      "title": "תחביבים ותחומי עניין",
      "1": "כשאני לא מקודד או לומד, אני משתדל להקדיש את זמני הפנוי לרשימה הארוכה של התחביבים והתחומים שמעניינים אותי. לדוגמה, אני מאוד אוהב לשלב את האהבה שלי לציור ולעיצוב גרפי עם הפרויקטים שלי.",
      "2": "אני גם נהנה לטייל ולגלות מקומות חדשים, לצלם אדריכלות, טבע ונופים, כמו גם לבלות זמן עם המשפחה שלי."
    }
  },
  "skills": {
    "programmingLanguages": "שפות תכנות",
    "frontendDevelopment": "פיתוח צד לקוח",
    "backendDevelopment": "פיתוח צד שרת",
    "databaseManagement": "ניהול מסדי נתונים",
    "devopsCloud": "דבאופס וענן",
    "versionControl": "בקרת גרסאות",
    "testingAutomation": "בדיקות ואוטומציה",
    "languages": "שפות"
  },
  "projects": {
    "atlaset": {
      "name": "Atlaset",
      "description": "Atlaset הוא כלי אינטראקטיבי למעקב אחר מדינות ומסלולי טיולים, התומך בשכבות-על מוגדרות על ידי המשתמש, מסננים גמישים, סמנים ומידע מפורט על מדינות. האפליקציה מאפשרת למשתמשים להציג מדינות בהן ביקרו, לתעד מסלולי טיול ולחקור נתונים אישיים באמצעות ממשק מפה אינטואיטיבי.",
      "involvement": {
        "1": "פיתחתי אפליקציית React עם Vite ו-TypeScript כפרויקט אישי",
        "2": "יישמתי ניהול מצב באמצעות Redux לזרימת נתונים צפויה וסקלאבילית",
        "3": "עיצבתי ויישמתי מפה עולמית אינטראקטיבית באמצעות React-Simple-Maps ו-D3.js",
        "4": "שילבתי מקורות נתונים שונים, כולל REST APIs או קבצי JSON סטטיים, כדי לספק מידע מקיף על מדינות",
        "5": "יישמתי תכונות כגון שכבות-על וסמנים מוגדרים על ידי המשתמש, מסננים גמישים, מידע מפורט על מדינות ולוח מחוונים",
        "6": "הוספתי אימות ושמירת נתונים באמצעות Firebase עבור חשבונות משתמשים ו-Dexie (IndexedDB) לאחסון לא מקוון",
        "7": "יישמתי בדיקות יחידה ואינטגרציה באמצעות Vitest ו-Cypress",
        "8": "הוספתי תמיכה ב-PWA ו-Electron לשימוש לא מקוון/במחשב שולחני",
        "9": "העליתי את האפליקציה לפרודקשן באמצעות Vercel (פרונט) ו-Render (בקאנד)"
      }
    },
    "voltrico": {
      "name": "Voltrico",
      "description": "Voltrico היא פלטפורמת מסחר אלקטרוני למכשירי חשמל שנבנתה בארכיטקטורת מיקרו-שירותים. משתמשים יכולים לדפדף ולחפש מוצרים, להוסיף פריטים לעגלת הקניות שלהם, לבצע הזמנות ולהציג את היסטוריית ההזמנות שלהם. מנהלי מערכת נהנים מתכונות ניהול מתקדמות, כולל בקרת מוצרים והזמנות, כמו גם ממשקים ניהוליים.",
      "involvement": {
        "1": "שכתבתי פרויקט מהלימודים שנכתב במקור ב-JavaScript/CSS/HTML ל-React ו-TypeScript",
        "2": "עיצבתי מחדש את ממשק האפליקציה לפריסה מודרנית וידידותית למשתמש, תוך שימוש ב-Tailwind CSS ו-CSS מותאם אישית",
        "3": "עיצבתי ויישמתי API RESTful, תוך מתן תיעוד מקיף עם Swagger",
        "4": "תכננתי את הבקאנד כך שיתאים לארכיטקטורת מיקרו-שירותים, תוך שימוש בטכנולוגיות שונות כגון Node.js, MongoDB, PostgreSQL ו-Go",
        "5": "יישמתי ארכיטקטורה מונעת אירועים באמצעות RabbitMQ לתקשורת בין מיקרו-שירותים",
        "6": "שיתפתי פעולה עם חבר שלי כדי למכל את האפליקציה באמצעות Docker ו-Docker Compose, לארגן אותה עם Kubernetes, להגדיר תשתית כקוד עם Terraform ולפרוס אותה ל-AWS באמצעות צינורות CI/CD עם GitHub Actions"
      }
    },
    "snapchef": {
      "name": "SnapChef",
      "description": "SnapChef היא אפליקציית מובייל שנועדה ליצור מתכונים מותאמים אישית המבוססים על מוצרים זמינים בבית. האפליקציה משתמשת בבינה מלאכותית כדי לזהות מרכיבים שונים (מתמונה שצולמה, קבלה סרוקה או ברקוד), ולאחר מכן יוצרת מתכוני בישול המבוססים על הנתונים והעדפות אחרות. בנוסף, האפליקציה מספקת הדרכה שלב אחר שלב בבישול ומאפשרת למשתמשים לשמור ולדרג את המתכונים שלהם, כמו גם לשתף אותם עם חברים.",
      "involvement": {
        "1": "עיצבתי ויישמתי אפליקציית מובייל חוצה-פלטפורמות באמצעות Flutter ו-Dart, תוך כדי שמירה על דפוסי ופרקטיקות UI/UX",
        "2": "יישמתי בדיקות יחידה ובדיקות ווידג'טים באמצעות מסגרת הבדיקות של Flutter ו-Mockito",
        "3": "יתפתי פעולה עם הצוות שלי כדי לבנות את הבקאנד (Node.js + Express.js, TypeScript, MongoDB) ולפרוס אותו לשרת מרוחק באמצעות PM2",
        "4": "עיצבתי ויישמתי API RESTful, תוך מתן תיעוד מקיף עם Swagger",
        "5": "עזרתי בעיצוב ובפיתוח של האתר הסטטי של האפליקציה, תוך שימוש ב-React, Next.js ו-Tailwind CSS",
        "6": "עבדתי עם טכנולוגיות כגון JWT, GCP (OAuth2, Cloud Vision, Generative AI, Vertex AI), Text-to-Speech, התראות מקומיות ורחוקות ו-WebSockets",
        "7": "ניהלתי את הפרויקט באמצעות Jira, תוך שימוש בשיטות Agile"
      }
    },
    "trevel": {
      "name": "Trevel",
      "description": "Trevel היא פלטפורמת רשת חברתית שנועדה לאפשר למשתמשים לשתף את חוויות הטיול שלהם, לפרסם רגעים חשובים מהטיול ולקיים אינטראקציה עם מטיילים אחרים. משתמשים יכולים להעלות תמונות, לכתוב סיפורי טיולים, להגיב על פוסטים ולסמן את התוכן המועדף עליהם. הפלטפורמה משלבת הצעות תוכן המונעות על ידי בינה מלאכותית כדי לשפר את חוויית המשתמש ולספק תובנות רלוונטיות לגבי הטיול.",
      "involvement": {
        "1": "עיצבתי ויישמתי את ממשק האפליקציה באמצעות React + Vite ו-TypeScript",
        "2": "פיתחתי את הבקאנד (Node.js + Express.js, TypeScript, MongoDB) והעליתי אותו לשרת מרוחק באמצעות PM2",
        "3": "עיצבתי ויישמתי API RESTful, תוך מתן תיעוד מקיף עם Swagger",
        "4": "יישמתי מערכי בדיקות עם Jest",
        "5": "עבדתי עם טכנולוגיות כגון JWT, GCP (OAuth2, Generative AI)"
      }
    },
    "hexgame": {
      "name": "Hex",
      "description": "Hex הוא משחק לוח אסטרטגיה מופשט המיושם באמצעות React. המשחק מאפשר לשני שחקנים להתחרות על לוח שש-צדדי, כאשר המטרה היא ליצור מסלול מחובר בצבע שלהם המקשר בין שני הצדדים ההפוכים של הלוח. הלוגיקה של המשחק מתבססת על מבני נתונים של קבוצות זרות כדי לקבוע את המנצח.",
      "involvement": {
        "1": "יישמתי את לוגיקת המשחק באמצעות מבני נתונים של קבוצות זרות",
        "2": "הרחבתי מטלה פשוטה מהלימודים למשחק פונקציונלי מלא באמצעות React",
        "3": "עיצבתי את ממשק המשחק להיות ידידותי למשתמש ומושך ויזואלית",
        "4": "יישמתי יריב AI פשוט למצב משחק יחיד"
      }
    },
    "visit": "צפייה בדף הפרויקט ←",
    "description": "תיאור",
    "technologies": "טכנולוגיות",
    "involvement": "המעורבות שלי",
    "links": "קישורים"
  },
  "contact": {
    "title": "צור קשר",
    "yourName": "שם",
    "yourEmail": "אימייל",
    "yourMessage": "הודעה",
    "sendMessage": "שלח הודעה",
    "successMessage": "תודה שפנית אליי! אני אחזור אליך בהקדם.",
    "errorMessage": "אופס! משהו השתבש. אנא נסה שוב מאוחר יותר."
  },
  "social": {
    "portfolio": "צפה בקוד המקור של האתר הזה בגיטהאב",
    "linkedin": "לינקדאין",
    "github": "גיטהאב",
    "cv": "קורות חיים",
    "npm": "npm",
    "email": "אימייל"
  }
}
